In [32]:
import pandas as pd
from sqlalchemy import create_engine, text
from sqlalchemy.orm import sessionmaker

In [33]:
# Параметры подключения к базе данных
db_connection_string = "postgresql://postgres:1234@localhost:5432/hw_3"
engine = create_engine(db_connection_string)

Session = sessionmaker(bind=engine)
session = Session()

In [34]:
# Звгрузим датафреймы для переодической самопроверки через pandas
customers = session.execute(text("SELECT * FROM customer"))
customers = customers.fetchall()
customers = pd.DataFrame(customers)

transactions = session.execute(text("SELECT * FROM transaction"))
transactions = transactions.fetchall()
transactions = pd.DataFrame(transactions)

display(customers.head(), transactions.head())

,customer_id,first_name,last_name,gender,dob,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation
0,1,Laraine,Medendorp,F,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,Eli,Bockman,Male,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,3,Arlin,Dearle,Male,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,0 Holy Cross Court,4211,QLD,Australia,9
3,4,Talbot,,Male,1961-10-03,,IT,Mass Customer,N,No,17979 Del Mar Point,2448,New South Wales,Australia,4
4,5,Sheila-kathryn,Calton,Female,1977-05-13,Senior Editor,n/a,Affluent Customer,N,Yes,9 Oakridge Court,3216,VIC,Australia,9

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost
0,1,2,2950,2017-02-25,False,Approved,Solex,Standard,medium,medium,71.49,53.62
1,2,3,3120,2017-05-21,True,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92
2,3,37,402,2017-10-16,False,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82
3,4,88,3135,2017-08-31,False,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10
4,5,78,787,2017-10-01,True,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48

> Будем реализовывать параметрические query-запросы для борьбы с sql-инъекциями и параллельного оттачивания наывыка работы с sqlalchemy :)
>

---

### Задание 1.

### Вывести распределение (количество) клиентов по сферам деятельности, отсортировав результат по убыванию количества. — (1 балл)

In [36]:
query = text(
    """
    SELECT job_industry_category AS industry, COUNT(*) AS customer_count
    FROM customer
    GROUP BY job_industry_category
    ORDER BY customer_count DESC;
    """
)

result_1 = session.execute(query)


result_1 = result_1.fetchall()

result_1 = pd.DataFrame(result_1)

display(result_1)

             industry  customer_count
0       Manufacturing             799
1  Financial Services             774
2                 n/a             656
3              Health             602
4              Retail             358
5            Property             267
6                  IT             223
7       Entertainment             136
8         Argiculture             113
9  Telecommunications              72

---

### Задание 2.

### Найти сумму транзакций за каждый месяц по сферам деятельности, отсортировав по месяцам и по сфере деятельности. — (1 балл)

In [37]:
query = text(
    """
    SELECT 
        c.job_industry_category, 
        DATE_TRUNC('month', t.transaction_date) AS transaction_month, 
        SUM(t.list_price) AS sum_trans
    FROM transaction t
    JOIN customer c ON t.customer_id = c.customer_id 
    GROUP BY 
        c.job_industry_category, 
        DATE_TRUNC('month', t.transaction_date)
    ORDER BY 
        c.job_industry_category, 
        transaction_month;
    """
)

result_2 = session.execute(query)


result_2 = result_2.fetchall()

result_2 = pd.DataFrame(result_2)

display(result_2)

    job_industry_category         transaction_month   sum_trans
0             Argiculture 2017-01-01 00:00:00+05:00   43513.812
1             Argiculture 2017-02-01 00:00:00+05:00   60016.810
2             Argiculture 2017-03-01 00:00:00+05:00   49048.492
3             Argiculture 2017-04-01 00:00:00+05:00   45978.310
4             Argiculture 2017-05-01 00:00:00+05:00   74518.680
..                    ...                       ...         ...
115                   n/a 2017-08-01 00:00:00+05:00  303576.300
116                   n/a 2017-09-01 00:00:00+05:00  279824.030
117                   n/a 2017-10-01 00:00:00+05:00  319553.620
118                   n/a 2017-11-01 00:00:00+05:00  292928.400
119                   n/a 2017-12-01 00:00:00+05:00  300793.160

[120 rows x 3 columns]

---

### Задание 3.

### Вывести количество онлайн-заказов для всех брендов в рамках подтвержденных заказов клиентов из сферы IT. — (1 балл)

In [38]:
query = text(
    """
    SELECT 
        t.brand, 
    COUNT(t.brand) AS count_brand
    FROM transaction t
    JOIN customer c ON t.customer_id = c.customer_id 
    WHERE 
        c.job_industry_category LIKE :category       
        AND t.order_status LIKE :status             
        AND t.online_order LIKE :online                
    GROUP BY 
        t.brand                                      
    ORDER BY 
        count_brand DESC;                            
    """
)

result_3 = session.execute(
    query,
    {
        "category": 'IT',
        "status": "Appr%",
        "online": "T%"
    },
)


result_3 = result_3.fetchall()

result_3 = pd.DataFrame(result_3)

display(result_3)

            brand  count_brand
0           Solex          101
1  Norco Bicycles           92
2        WeareA2B           90
3  Giant Bicycles           89
4   Trek Bicycles           82
5      OHM Cycles           78
6                            8

---

### Задание 4.

### Найти по всем клиентам сумму всех транзакций (list_price), максимум, минимум и количество транзакций, отсортировав результат по убыванию суммы транзакций и количества клиентов. Выполните двумя способами: используя только group by и используя только оконные функции. Сравните результат. — (2 балла)

In [39]:
# GROUP BY
query = text(
    """
    SELECT 
	    c.customer_id,
        SUM(t.list_price) AS sum_orders,
        MAX(t.list_price) AS max_sum_order,
        MIN(t.list_price) AS min_sum_order,
        COUNT(t.transaction_id) AS number_of_orders
    FROM transaction t
    JOIN customer c ON t.customer_id = c.customer_id 
    GROUP BY c.customer_id
    ORDER BY sum_orders DESC, number_of_orders DESC;                          
    """
)

result_4_1 = session.execute(query)


result_4_1 = result_4_1.fetchall()

result_4_1 = pd.DataFrame(result_4_1)

display(result_4_1)

      customer_id  sum_orders  max_sum_order  min_sum_order  number_of_orders
0            2183   19071.322        2005.66         230.91                14
1            1129   18349.270        1992.93         290.62                13
2            1597   18052.680        2091.47         360.40                12
3             941   17898.459        2091.47        1057.51                10
4            2788   17258.940        2083.94         183.86                11
...           ...         ...            ...            ...               ...
3488         2423     202.620         202.62         202.62                 1
3489         3189     200.700         100.35         100.35                 2
3490         2274     142.980          71.49          71.49                 2
3491         2532      71.490          71.49          71.49                 1
3492         3292      60.340          60.34          60.34                 1

[3493 rows x 5 columns]

In [24]:
# Оконная функция
# GROUP BY
query = text(
    """
    SELECT 
        c.customer_id,
        SUM(t.list_price) OVER sales_window AS sum_orders,
        MIN(t.list_price) OVER sales_window AS min_sum_order,
        MAX(t.list_price) OVER sales_window AS max_sum_order,
        COUNT(t.list_price) OVER sales_window AS number_of_orders
    FROM transaction t
    JOIN customer c ON t.customer_id = c.customer_id
    WINDOW sales_window AS (PARTITION BY c.customer_id)
    ORDER BY sum_orders DESC, number_of_orders DESC;                          
    """
)

result_4_2 = session.execute(query)


result_4_2 = result_4_2.fetchall()

result_4_2 = pd.DataFrame(result_4_2)

display(result_4_2)

       customer_id  sum_orders  min_sum_order  max_sum_order  number_of_orders
0             2183    19071.32         230.91        2005.66                14
1             2183    19071.32         230.91        2005.66                14
2             2183    19071.32         230.91        2005.66                14
3             2183    19071.32         230.91        2005.66                14
4             2183    19071.32         230.91        2005.66                14
...            ...         ...            ...            ...               ...
19992         3189      200.70         100.35         100.35                 2
19993         2274      142.98          71.49          71.49                 2
19994         2274      142.98          71.49          71.49                 2
19995         2532       71.49          71.49          71.49                 1
19996         3292       60.34          60.34          60.34                 1

[19997 rows x 5 columns]

> Запрос с GROUP BY: Получаем одну запись для каждого клиента, показывая сводные данные об их транзакциях.

> Оконный запрос: Возввращает для каждого клиента несколько строк, так как он дублирует записи с агрегированными данными для каждого клиента.

---

### Задание 5.

### Найти имена и фамилии клиентов с минимальной/максимальной суммой транзакций за весь период (сумма транзакций не может быть null). Напишите отдельные запросы для минимальной и максимальной суммы. — (2 балла)

In [40]:
# Минимальная сумма транзакций
query = text(
    """
    WITH customer_name AS (
        SELECT 
            c.customer_id id,
            CONCAT(c.first_name, ' ', c.last_name) AS full_name,
            SUM(t.list_price) sum_order
        FROM transaction t
        JOIN customer c ON t.customer_id = c.customer_id
        GROUP BY id, full_name
        HAVING SUM(t.list_price) IS NOT NULL AND SUM(t.list_price) > 0
    )
    SELECT 
        id, 
        full_name, 
        sum_order AS min_sum
    FROM customer_name
    WHERE sum_order = (SELECT MIN(sum_order) FROM customer_name);                       
    """
)

result_5_1 = session.execute(query)


result_5_1 = result_5_1.fetchall()

result_5_1 = pd.DataFrame(result_5_1)

display(result_5_1)

     id        full_name  min_sum
0  3292  Hamlen Slograve    60.34

In [41]:
# Максимальная сумма транзакций
query = text(
    """
    WITH customer_name AS (
        SELECT 
            c.customer_id id,
            CONCAT(c.first_name, ' ', c.last_name) AS full_name,
            SUM(t.list_price) sum_order
        FROM transaction t
        JOIN customer c ON t.customer_id = c.customer_id
        GROUP BY id, full_name
        HAVING SUM(t.list_price) IS NOT NULL AND SUM(t.list_price) > 0
    )
    SELECT 
        id, 
        full_name, 
        sum_order AS max_sum
    FROM customer_name
    WHERE sum_order = (SELECT MAX(sum_order) FROM customer_name);                       
    """
)

result_5_2 = session.execute(query)


result_5_2 = result_5_2.fetchall()

result_5_2 = pd.DataFrame(result_5_2)

display(result_5_2)

     id      full_name    max_sum
0  2183  Jillie Fyndon  19071.322

---

### Задание 6.

### Вывести только самые первые транзакции клиентов. Решить с помощью оконных функций. — (1 балл)

In [42]:
# Максимальная сумма транзакций
query = text(
    """
    WITH first_transaction AS (
        SELECT 
            t.transaction_id,
            t.transaction_date,
            c.customer_id,
            t.brand,
            t.list_price,
            t.online_order,
            t.order_status,
            t.product_line,
            t.standard_cost,
            t.product_class,
            CONCAT(c.first_name, ' ', c.last_name) AS full_name, 
            ROW_NUMBER() OVER (PARTITION BY c.customer_id ORDER BY t.transaction_date) AS row_num
        FROM transaction t
        JOIN customer c ON t.customer_id = c.customer_id
    )
    SELECT 
        transaction_id,
        customer_id,
        full_name,
        transaction_date,
        brand,
        product_line,
        product_class,
        online_order,
        order_status,
        list_price 
    FROM first_transaction 
    WHERE row_num = 1 
    ORDER BY customer_id;                       
    """
)

result_6 = session.execute(query)


result_6 = result_6.fetchall()

result_6 = pd.DataFrame(result_6)

display(result_6)

,transaction_id,customer_id,full_name,transaction_date,brand,product_line,product_class,online_order,order_status,list_price
0,9785,1,Laraine Medendorp,2017-01-05,Norco Bicycles,Standard,medium,False,Approved,360.40
1,2261,2,Eli Bockman,2017-05-04,Giant Bicycles,Standard,medium,True,Approved,1403.50
2,10302,3,Arlin Dearle,2017-02-23,Giant Bicycles,Standard,medium,False,Approved,1311.44
3,12441,4,Talbot,2017-04-03,Giant Bicycles,Standard,medium,False,Approved,569.56
4,2291,5,Sheila-kathryn Calton,2017-03-03,Norco Bicycles,Mountain,low,True,Approved,688.63
...,...,...,...,...,...,...,...,...,...,...
3488,9769,3496,Danya Burnyeat,2017-03-07,Trek Bicycles,Mountain,low,False,Approved,574.64
3489,8276,3497,Thia O'Day,2017-09-01,Solex,Standard,medium,True,Approved,575.27
3490,13469,3498,Lois Abrahim,2017-02-03,WeareA2B,Standard,medium,True,Approved,1231.15
3491,2794,3499,Shelton Tewkesberrie,2017-01-12,Solex,Standard,medium,False,Approved,478.16
3492,6309,3500,Josy Fleeman,2017-01-09,Giant Bicycles,Road,medium,True,Approved,792.90

---

### Задание 7.

### Вывести имена, фамилии и профессии клиентов, между транзакциями которых был максимальный интервал (интервал вычисляется в днях) — (2 балла).

In [43]:
# Через group by
query = text(
    """
    WITH dates_names AS (
        SELECT 
            c.customer_id,
            t.transaction_date,
            CONCAT(c.first_name, ' ', c.last_name) AS full_name,
            c.job_title
        FROM transaction t
        JOIN customer c ON t.customer_id = c.customer_id
    ),
    date_intervals AS (
        SELECT 
            customer_id,
            full_name,
            job_title,
            MAX(transaction_date) - MIN(transaction_date) AS delta_days
        FROM dates_names 
        GROUP BY customer_id, full_name, job_title
    ),
    max_interval AS (
        SELECT 
            MAX(delta_days) AS max_delta
        FROM date_intervals
    )
    SELECT *
    FROM date_intervals
    WHERE delta_days = (SELECT max_delta FROM max_interval);
    """
)

result_7_1 = session.execute(query)


result_7_1 = result_7_1.fetchall()

result_7_1 = pd.DataFrame(result_7_1)

display(result_7_1)

   customer_id       full_name                job_title  delta_days
0         1721  Delcine Hansod  Senior Quality Engineer         362

In [44]:
# Через оконные функции
query = text(
    """
    WITH days_interval AS (
        SELECT 
            c.customer_id,
            CONCAT(c.first_name, ' ', c.last_name) AS full_name,
            c.job_title,
            t.transaction_date,
            FIRST_VALUE(t.transaction_date) OVER (PARTITION BY c.customer_id ORDER BY t.transaction_date) AS first_date,
            LAST_VALUE(t.transaction_date) OVER (PARTITION BY c.customer_id ORDER BY t.transaction_date) AS last_date
        FROM 
            transaction t
        JOIN 
            customer c ON t.customer_id = c.customer_id
    ),
    delta_days AS (
        SELECT
            customer_id,
            full_name,
            last_date - first_date AS delta_days
        FROM 
            days_interval 
    ),
    max_interval AS (
        SELECT 
            MAX(delta_days) AS max_delta
        FROM 
            delta_days
    )
    SELECT * 
    FROM delta_days
    WHERE delta_days = (SELECT max_delta FROM max_interval);
    """
)

result_7_2 = session.execute(query)


result_7_2 = result_7_2.fetchall()

result_7_2 = pd.DataFrame(result_7_2)

display(result_7_2)

   customer_id       full_name  delta_days
0         1721  Delcine Hansod         362

In [45]:
min_date = transactions.groupby("customer_id")["transaction_date"].min()
max_date = transactions.groupby("customer_id")["transaction_date"].max()
test_frame = pd.DataFrame(max_date - min_date).sort_values(by="transaction_date", ascending=False)

display(test_frame)

              transaction_date
customer_id
1721         362 days, 0:00:00
3470         361 days, 0:00:00
2418         361 days, 0:00:00
1691         361 days, 0:00:00
2805         360 days, 0:00:00
...                        ...
3428                   0:00:00
1544                   0:00:00
862                    0:00:00
2394                   0:00:00
2749                   0:00:00

[3494 rows x 1 columns]

> Все 3 варианта совпадают

---
### Закрываем сессию

In [31]:
# Закрытие сессии
session.close()